In [1]:
import pandas as pd
import numpy as np
###  Dataset(s) taken from www.ons.gov.uk and www.data.gov.ie

####  The first dataset was found on a UK website.

In [2]:
df=pd.read_excel("outputukhousebuilding.xlsx", sheet_name="2a",skiprows=5)
df.head()

,Revised,Period,Started - All Dwellings,Started - Private Enterprise,Started - Housing Associations,Started - Local Authorities,Completed - All Dwellings,Completed - Private Enterprise,Completed - Housing Associations,Completed - Local Authorities
0,NaN,1969-70,357070,171470,10060,175550,378320,185920,7390,184970
1,NaN,1970-71,330950,169150,8600,153210,362220,174350,8510,179370
2,NaN,1971-72,358610,212200,11260,135160,364480,196300,10710,157460
3,NaN,1972-73,361850,232720,9740,119500,330930,200770,7780,122400
4,NaN,1973-74,338000,220660,11200,106150,304630,191090,8990,104580

####  We shall create a subset of our dataframe with two columns only to check the correlation between the no. of houses started and the no. of houses completed.  We shall name this mini-dataframe df1.

In [3]:
df1=df[["Started - All Dwellings","Completed - All Dwellings"]]
#df1.head()
df1.dtypes

Started - All Dwellings      int64
Completed - All Dwellings    int64
dtype: object

#### Test 1. Let us find the correlation between "all dwellings-started" and "all dwellings-completed".  H0 is that there is a strong correlation.

In [4]:
df1.info()
df1.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 2 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Started - All Dwellings    53 non-null     int64
 1   Completed - All Dwellings  53 non-null     int64
dtypes: int64(2)
memory usage: 976.0 bytes

(53, 2)

#### Pearson's correlation

In [5]:
import pandas as pd
print(df1.corr(method='pearson'))

                           Started - All Dwellings  Completed - All Dwellings
Started - All Dwellings                   1.000000                   0.927824
Completed - All Dwellings                 0.927824                   1.000000

#### H0 cannot be rejected.  Correlation is very high. 0.9274

####  We shall now look at our other dataset which displays the monthly cost price index from 1994-2016.

In [6]:
dataset=pd.read_csv("national_house_construction_cost_index_0.csv", skiprows=2)
dataset.shape

(14, 24)

####  n.b. The cost of constructing a house (per sq metre) in January 2002 it cost €169.9 per square metre
####  n.b. The cost of constructing a house (per sq metre) in January 2016 it cost €207.4 per square metre

In [7]:
dataset = dataset.iloc[:-2]  ##  Deleting the bottom two rows that we dont need
dataset

,Month,1994,1995,1996,1997,1998,1999,2000,2001,2002,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,January,109.2,113.5,115.9,118,122.9,126.3,135.8,154.3,169.9,...,198.8,207.4,208,206.9,210.2,202.5,204.1,204.9,206.2,207.4
1,February,109.3,114.1,115.7,118.5,123.1,126.4,136.1,154.7,170,...,198.8,208.2,207.3,207.2,210.5,202.6,204.2,205.4,206,207.1
2,March,109.4,114.1,115.9,118.8,123.8,126.5,136.4,155.6,169.5,...,199.4,208.6,206.8,207.3,200.7,202.7,204.3,205.4,206.5,NaN
3,April,110.3,114.1,115.9,119.8,123.8,130.5,136.5,157.4,169.5,...,200,208.9,206.5,207.9,201,203.4,204.5,205.6,206.8,NaN
4,May,110.1,114.1,115.9,119.8,124.5,130.5,136.8,157.6,169.5,...,200.1,209.4,206.5,208.7,201.2,203.6,204.5,205.9,207.2,NaN
5,June,110.6,114.1,116,119.9,124.5,130.5,136.9,157.7,169.7,...,200.3,209.9,206,208.6,201.4,203.6,204.8,206,207.6,NaN
6,July,110.7,114.5,116,120.8,125.7,131.5,137.2,161.1,173.8,...,203.7,210.4,206,209.4,201.5,204.1,204.8,206,207.4,NaN
7,August,110.9,114.5,116,121,125.7,131.5,137.2,165.9,173.9,...,203.6,210.4,206,209.6,201.9,204.1,205,206.6,207.4,NaN
8,September,112.2,115.7,116.9,121.5,126,134.1,137.7,166,173.9,...,203.7,210.5,206.1,209.5,202.1,203.7,205.1,206.4,207.3,NaN
9,October,112.7,115.8,117.1,122,126.2,134.7,153.8,169.3,173.9,...,203.8,210.1,206.2,209.5,202,203.8,205.4,206.7,207.2,NaN
10,November,112.9,115.9,117.2,122.6,126.2,134.8,153.8,169.4,174,...,203.8,209.9,206.2,209.5,202.2,204,205.4,206.5,207.6,NaN
11,December,113.1,115.9,117.2,122.6,126.1,134.9,153.9,169.3,174.1,...,204.2,209.3,206.2,209.8,202.3,204.2,204.7,206.2,207.4,NaN

In [8]:
dataset.rename(columns = {'1994':'Year_1994'}, inplace = True)  ###  Rename columns for clarity.
dataset.rename(columns = {'1995':'Year_1995'}, inplace = True)
dataset.rename(columns = {'1996':'Year_1996'}, inplace = True)
dataset.rename(columns = {'1997':'Year_1997'}, inplace = True)
dataset.rename(columns = {'1998':'Year_1998'}, inplace = True)
dataset.rename(columns = {'1999':'Year_1999'}, inplace = True)
dataset.rename(columns = {'2000':'Year_2000'}, inplace = True)
dataset.rename(columns = {'2001':'Year_2001'}, inplace = True)
dataset.rename(columns = {'2002':'Year_2002'}, inplace = True)
dataset.rename(columns = {'2003':'Year_2003'}, inplace = True)
dataset.rename(columns = {'2004':'Year_2004'}, inplace = True)
dataset.rename(columns = {'2005':'Year_2005'}, inplace = True)
dataset.rename(columns = {'2006':'Year_2006'}, inplace = True)
dataset.rename(columns = {'2007':'Year_2007'}, inplace = True)
dataset.rename(columns = {'2008':'Year_2008'}, inplace = True)
dataset.rename(columns = {'2009':'Year_2009'}, inplace = True)
dataset.rename(columns = {'2010':'Year_2010'}, inplace = True)
dataset.rename(columns = {'2011':'Year_2011'}, inplace = True)
dataset.rename(columns = {'2012':'Year_2012'}, inplace = True)
dataset.rename(columns = {'2013':'Year_2013'}, inplace = True)
dataset.rename(columns = {'2014':'Year_2014'}, inplace = True)
dataset.rename(columns = {'2015':'Year_2015'}, inplace = True)
dataset.rename(columns = {'2016':'Year_2016'}, inplace = True)

dataset.head(1)

,Month,Year_1994,Year_1995,Year_1996,Year_1997,Year_1998,Year_1999,Year_2000,Year_2001,Year_2002,...,Year_2007,Year_2008,Year_2009,Year_2010,Year_2011,Year_2012,Year_2013,Year_2014,Year_2015,Year_2016
0,January,109.2,113.5,115.9,118,122.9,126.3,135.8,154.3,169.9,...,198.8,207.4,208,206.9,210.2,202.5,204.1,204.9,206.2,207.4

#### We need to change ''Month' to 'category' as this is an effective use of memory.
####  Change "Year_1994" and so forth to numerical.

In [9]:
dataset.Month=dataset.Month.astype('category')
dataset.Year_1994=dataset.Year_1994.astype('float')
dataset.Year_1995=dataset.Year_1995.astype('float')
dataset.Year_1996=dataset.Year_1996.astype('float')
dataset.Year_1997=dataset.Year_1997.astype('float')
dataset.Year_1998=dataset.Year_1998.astype('float')
dataset.Year_1999=dataset.Year_1999.astype('float')
dataset.Year_2000=dataset.Year_2000.astype('float')
dataset.Year_2001=dataset.Year_2001.astype('float')
dataset.Year_2002=dataset.Year_2002.astype('float')
dataset.Year_2003=dataset.Year_2003.astype('float')
dataset.Year_2004=dataset.Year_2004.astype('float')
dataset.Year_2005=dataset.Year_2005.astype('float')
dataset.Year_2006=dataset.Year_2006.astype('float')
dataset.Year_2007=dataset.Year_2007.astype('float')
dataset.Year_2008=dataset.Year_2008.astype('float')
dataset.Year_2009=dataset.Year_2009.astype('float')
dataset.Year_2010=dataset.Year_2010.astype('float')
dataset.Year_2011=dataset.Year_2011.astype('float')
dataset.Year_2012=dataset.Year_2012.astype('float')
dataset.Year_2013=dataset.Year_2013.astype('float')
dataset.Year_2014=dataset.Year_2014.astype('float')
dataset.Year_2015=dataset.Year_2015.astype('float')
dataset.Year_2016=dataset.Year_2016.astype('float')

In [10]:
dataset.dtypes

Month        category
Year_1994     float64
Year_1995     float64
Year_1996     float64
Year_1997     float64
Year_1998     float64
Year_1999     float64
Year_2000     float64
Year_2001     float64
Year_2002     float64
Year_2003     float64
Year_2004     float64
Year_2005     float64
Year_2006     float64
Year_2007     float64
Year_2008     float64
Year_2009     float64
Year_2010     float64
Year_2011     float64
Year_2012     float64
Year_2013     float64
Year_2014     float64
Year_2015     float64
Year_2016     float64
dtype: object

###  Levene's test for homogeneity of variance. Test (2)

In [11]:
import scipy.stats as stats

#Levene's test centered at the mean
stats.levene(dataset.Year_1999, dataset.Year_1998, dataset.Year_1997, center='mean')
### We have the mean construction index costs for 1997, 1998 and 1999.  Lets see if they are equal (H0)

LeveneResult(statistic=5.211450729927005, pvalue=0.010792428086225884)

####  H0 states that the variances are equal. However p <.05, therefore the variances are not homogenous (equal)

####  We established from Levene's test that the variances are unequal so we will perform  Signed Rank test.

### Test (3) The Wilcoxon Signed-Rank Test is the non-parametric version of the paired samples t-test.

#### It is used to test whether or not there is a significant difference between two population means when the distribution of the differences between the two samples cannot be assumed to be normal.

In [12]:
import scipy.stats as stats 
group1=dataset.Year_1998
group2=dataset.Year_1999
#perform the Wilcoxon-Signed Rank Test
stats.wilcoxon(group1, group2)

#  results

WilcoxonResult(statistic=0.0, pvalue=0.00048828125)

#### Since the p-value is less than 0.05, we reject the null hypothesis. We have sufficient evidence to say that the means are not equal between the two groups.

####  Test (4) Anova

In [13]:
#### ANOVA stands for "Analysis of Variance" and it is an omnibus test, meaning that it looks for a significant difference overall between the mean averages of 2 or more groups.

#### We will import a JSON file for the Anova. This Irish dataset is one where we have notifications of a builder's intention to commence work on a property.

In [14]:
import statsmodels.api as sm
from statsmodels.formula.api import ols
from scipy import stats
import scipy as scipy

In [15]:
dfCommencement = pd.read_json('https://opendata.housing.gov.ie/dataset/ea008355-8084-48cf-abc7-681f31f8cc72/resource/73296361-12c0-4d0b-99ae-809c8794dc0d/download/bcms_commencement_notices_2019.json')
dfCommencement.head()
dfCommencement.columns

Index(['Local Authority', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul',
       'Aug', 'Sep', 'Oct', 'Nov', 'Dec'],
      dtype='object')

In [16]:
dfCommencement.head(5) ### 2019 Commencement notices.

  Local Authority  Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
0   Carlow County    5    6    9    6   13   13   14   11    9    6    6    7
1    Cavan County    5   10   14    7   10   11    9   14    8   10    4    5
2    Clare County   16   24   22   30   26   12   18   19   20   21   16   12
3       Cork City    6    4    8    2    5    9    8   13    3   24   10   11
4     Cork County   43   75   81   74   67   64   84   56   53   61   46   40

In [17]:
# ONE-WAY ANOVA  Test Number (4)  H0 states the means of the 2019 dataset January-July are equal
model = ols('Jan~Dec', data = dfCommencement).fit()
aov = sm.stats.anova_lm(model, type=2)
print(aov)

            df        sum_sq       mean_sq          F        PR(>F)
Dec        1.0  15329.937603  15329.937603  200.11375  4.558496e-15
Residual  31.0   2374.789670     76.606118        NaN           NaN

####  p-value is less than alpha (0.05) so we can reject H0.  The means are significantly different

#### Test (5) Where you have two independent samples but you do not know that they have equal variance, you can use Welch's t-test.

####  H0 states that the total number of houses completed privately and the total number of houses completed by the Local Authorities share equal variance.  Again we will use a subset of our Output UK Housing dataset with 2 columns only.

In [18]:
df2=df[["Completed - Private Enterprise","Completed - Local Authorities"]]
df2.columns

Index(['Completed - Private Enterprise', 'Completed - Local Authorities'], dtype='object')

In [19]:
scipy.stats.ttest_ind(df2['Completed - Private Enterprise'], df2['Completed - Local Authorities'], equal_var=False)

Ttest_indResult(statistic=13.976122539368486, pvalue=3.4952597822295744e-22)

####  We reject H0.  The variance(s) amongst the mean averages of the privately and publicly completed houses are not similar.

In [ ]:
https://github.com/osuade